title: Exchange Items Moved to Deleted Folder
id: 7d632a1e-8f21-4b1a-982c-d69123f1a234
status: test
description: |
  Detects when a user moves items to the deleted items folder in Exchange. 
  This can be indicative of a threat actor attempting to hide their tracks after unauthorised access or sensitive data interaction.
author: Rhys McClew
date: 2026-02-10
tags:
    - attack.defense_evasion
    - attack.t1070.008
logsource:
    service: threat_management
    product: m365
detection:
    selection:
        operation: 'MoveToDeletedItems'
    condition: selection
falsepositives:
    - Regular user maintenance of mailbox
    - Automated cleanup scripts or retention policies
level: low